БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыКомплексныхРасчетовКлиентов/ВидыКомплексныхРасчетовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКомплексныхРасчетовКлиентов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКомплексныхРасчетовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленныйУчетВзаиморасчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйДолг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентАванса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьМенятьПараметрыДолга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПродажуНеПоЦенеРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрименениеСкидокПриПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксНумерации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьДолг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИгнорироватьДолг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>ПараметрСпецификации</name>
      <type>
        <types>CatalogRef.ПараметрыСпецификаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРабот</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <comment>Виды номенклатуры</comment>
  <enumValues>
    <name>Материал</name>
    <comment>Основной вид ТМЦ, учитываемый на складах</comment>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <comment>Услуга, не хранится на складах</comment>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыКомплексныхРасчетовКлиентов/ТипыКомплексныхРасчетовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКомплексныхРасчетовКлиентов</name>
  <enumValues>
    <name>КомплекснаяПрограмма</name>
  </enumValues>
  <enumValues>
    <name>ПредварительныйРасчет</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственныйРасчет</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыКомплексныхРасчетовКлиентов/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных
&НаКлиенте 
Перем мКэшВидовНоменклатуры;

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Объект.Прейскурант.Пустая() Тогда
			Объект.Прейскурант = УчетнаяПолитика.ОсновнойПрейскурант;
		КонецЕсли;
		
	КонецЕсли;
	
	ЕстьХарактеристикиВСоставе = Ложь;
	Для Каждого СтрокаСостава Из Объект.Состав Цикл
		Если ЗначениеЗаполнено(СтрокаСостава.ХарактеристикаНоменклатуры) Тогда
			ЕстьХарактеристикиВСоставе = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Элементы.СоставХарактеристикаНоменклатуры.Видимость = УчетнаяПолитика.ВестиУчетПоХарактеристикам Или ЕстьХарактеристикиВСоставе;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Состав.Количество() > 0 Тогда
		НоменклатураСостава = Новый Массив;
		Для Каждого СтрокаСостава Из Объект.Состав Цикл
			НоменклатураСостава.Добавить(СтрокаСостава.Номенклатура);
		КонецЦикла;
		мКэшВидовНоменклатуры = ОбщегоНазначения.ПолучитьСоответствиеВидовНоменклатуры(НоменклатураСостава);
	Иначе
		мКэшВидовНоменклатуры = Новый Соответствие; 
	КонецЕсли;
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СоставПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.Состав.ТекущийЭлемент = Элементы.СоставЕдиницаИзмерения Тогда
		ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			Элементы.СоставЕдиницаИзмерения.ТолькоПросмотр = 
				мКэшВидовНоменклатуры.Получить(ТекущиеДанные.Номенклатура) <> ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Материал");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Количество = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ТекущиеДанные.ЕдиницаИзмерения = Ценообразование.ПолучитьЕдиницуПродажиНоменклатуры(ТекущиеДанные.Номенклатура);
	КонецЕсли;
	
	ВидНоменклатуры = мКэшВидовНоменклатуры.Получить(ТекущиеДанные.Номенклатура);
	Если ВидНоменклатуры = Неопределено Тогда
		ВидНоменклатуры = ?(ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения), 
							ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Материал"), 
							ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Услуга"));
							
		мКэшВидовНоменклатуры.Вставить(ТекущиеДанные.Номенклатура, ВидНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	НастроитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	ЭтоПредварительныйРасчет = Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыКомплексныхРасчетовКлиентов.ПредварительныйРасчет");
	ЭтоПроизводственныйРасчет = Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыКомплексныхРасчетовКлиентов.ПроизводственныйРасчет");
	
	Элементы.ОбособленныйУчетВзаиморасчетов.Видимость = Не ЭтоПредварительныйРасчет;
	Элементы.ГруппаНастройкиОграниченийРасчета.Видимость = Не ЭтоПредварительныйРасчет;
	Элементы.СоставИгнорироватьДолг.Видимость = Не ЭтоПредварительныйРасчет;
	Элементы.ПроцентАванса.Видимость = (Объект.ОбособленныйУчетВзаиморасчетов И ЭтоПроизводственныйРасчет);
	Элементы.ДопустимыйДолг.Видимость = Не Объект.ИгнорироватьДолг;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбособленныйУчетВзаиморасчетовПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ИгнорироватьДолгПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти
